stress-test/test.yaml
config:
  target: "http://localhost:3000"
  processor: "./randomizeId.js"
  phases:
    - duration: 20
      arrivalRate: 10
      name: 10 RPS
    - duration: 20
      arrivalRate: 100
      name: 100 RPS
    - duration: 120
      arrivalRate: 1000
      name: 1000 RPS
scenarios:
  - name: "Fetcch Hostel"
    flow:
      - function: generateId
      - get:
          url: "/api/house/{{ id }}/hostel"
      - get:
          url: "/api/house/{{ id }}/rules"
      - get:
          url: "/api/house/{{ id }}/address"
      - get:
          url: "/api/house/{{ id }}/description"